RDVMI.rdvmi-ext/src/InformationRegisters/рдв_СообщенияИнтеграции/рдв_СообщенияИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_СообщенияИнтеграции</name>
  <resources>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.рдв_ВидыСообщенийИнтеграции</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <type>
      <types>EnumRef.рдв_НаправленияСообщенийИнтеграции</types>
    </type>
  </resources>
  <attributes>
    <name>АдресМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.рдв_СтатусыОбработкиСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиНачалоЧаса</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.рдв_ВнешниеСистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ОбъектыСообщенийИнтеграции/рдв_ОбъектыСообщенийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ОбъектыСообщенийИнтеграции</name>
  <attributes>
    <name>ДатаСоответствия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСообщения</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиНачалоЧаса</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_КонтекстСообщенийИнтеграции/рдв_КонтекстСообщенийИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_КонтекстСообщенийИнтеграции</name>
  <resources>
    <name>Контекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДлительностьМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытияМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.рдв_СтатусыИнтеграции</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКонтекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиНачалоЧаса</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_СообщенияИнтеграции/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция Сообщение(ИдентификаторСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщенияИнтеграции.ИдентификаторСообщения,
	|	СообщенияИнтеграции.ИдентификаторСобытия,
	|	СообщенияИнтеграции.ДатаЗаписиНачалоЧаса,
	|	СообщенияИнтеграции.ВидСообщения,
	|	СообщенияИнтеграции.ДанныеСообщения,
	|	СообщенияИнтеграции.РазмерСообщения,
	|	СообщенияИнтеграции.Направление,
	|	СообщенияИнтеграции.ВнешняяСистема,
	|	СообщенияИнтеграции.АдресМетода,
	|	СообщенияИнтеграции.СтатусОбработки,
	|	СообщенияИнтеграции.ДатаРегистрацииМс
	|ИЗ
	|	РегистрСведений.рдв_СообщенияИнтеграции КАК СообщенияИнтеграции
	|ГДЕ
	|	СообщенияИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат  Неопределено;
	КонецЕсли;
	
	Структура = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Структура.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Структура, Выборка);
	
	Возврат Структура;
	
КонецФункции

Функция СообщениеВесьКонтекст(ИдентификаторСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщенияИнтеграции.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	СообщенияИнтеграции.ДатаЗаписиНачалоЧаса КАК ДатаЗаписиНачалоЧаса,
	|	СообщенияИнтеграции.ДанныеСообщения КАК ДанныеСообщения,
	|	СообщенияИнтеграции.РазмерСообщения КАК РазмерСообщения
	|ИЗ
	|	РегистрСведений.рдв_СообщенияИнтеграции КАК СообщенияИнтеграции
	|ГДЕ
	|	СообщенияИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыСообщенийИнтеграции.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ОбъектыСообщенийИнтеграции.ОбъектСообщения КАК ОбъектСообщения,
	|	ОбъектыСообщенийИнтеграции.ДатаЗаписиНачалоЧаса КАК ДатаЗаписиНачалоЧаса,
	|	ОбъектыСообщенийИнтеграции.ДатаСоответствия КАК ДатаСоответствия
	|ИЗ
	|	РегистрСведений.рдв_ОбъектыСообщенийИнтеграции КАК ОбъектыСообщенийИнтеграции
	|ГДЕ
	|	ОбъектыСообщенийИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтекстСообщенийИнтеграции.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	КонтекстСообщенийИнтеграции.ИдентификаторКонтекста КАК ИдентификаторКонтекста,
	|	КонтекстСообщенийИнтеграции.ДатаЗаписиНачалоЧаса КАК ДатаЗаписиНачалоЧаса,
	|	КонтекстСообщенийИнтеграции.Контекст КАК Контекст,
	|	КонтекстСообщенийИнтеграции.ДлительностьМс КАК ДлительностьМс,
	|	КонтекстСообщенийИнтеграции.ДатаОтвета КАК ДатаОтвета,
	|	КонтекстСообщенийИнтеграции.Статус КАК Статус,
	|	КонтекстСообщенийИнтеграции.ДатаСобытия,
	|	КонтекстСообщенийИнтеграции.ДатаСобытияМс КАК ДатаСобытияМс
	|ИЗ
	|	РегистрСведений.рдв_КонтекстСообщенийИнтеграции КАК КонтекстСообщенийИнтеграции
	|ГДЕ
	|	КонтекстСообщенийИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытияМс УБЫВ";	
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	
	Пакет = Запрос.ВыполнитьПакет();
	Структура = Новый Структура;
	СообщенияИнтеграции = Пакет[Пакет.ВГраница()-2].Выгрузить();
	Структура.Вставить("Сообщение", СообщенияИнтеграции);
	Объекты = Пакет[Пакет.ВГраница()-1].Выгрузить();
	Структура.Вставить("Объекты", Объекты);
	Контекст = Пакет[Пакет.ВГраница()].Выгрузить();
	Структура.Вставить("Контекст", Контекст);
	
	Возврат Структура;
	
КонецФункции

Функция СообщениеОбъекты(ИдентификаторСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыСообщенийИнтеграции.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	ОбъектыСообщенийИнтеграции.ОбъектСообщения КАК ОбъектСообщения,
	|	ОбъектыСообщенийИнтеграции.ДатаЗаписиНачалоЧаса КАК ДатаЗаписиНачалоЧаса,
	|	ОбъектыСообщенийИнтеграции.ДатаСоответствия КАК ДатаСоответствия
	|ИЗ
	|	РегистрСведений.рдв_ОбъектыСообщенийИнтеграции КАК ОбъектыСообщенийИнтеграции
	|ГДЕ
	|	ОбъектыСообщенийИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения";	
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	
	Объекты = Запрос.Выполнить().Выгрузить();
	
	Возврат Объекты;
	
КонецФункции

Функция СообщениеДанные(ИдентификаторСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СообщенияИнтеграции.ДанныеСообщения
	|ИЗ
	|	РегистрСведений.рдв_СообщенияИнтеграции КАК СообщенияИнтеграции
	|ГДЕ
	|	СообщенияИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат  Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Данные = Выборка.Следующий();
	
	Возврат Выборка.ДанныеСообщения;
	
КонецФункции

Функция СообщениеКонтекст(ИдентификаторСообщения, ИдентификаторКонтекста) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтекстСообщенийИнтеграции.ИдентификаторСообщения,
		|	КонтекстСообщенийИнтеграции.ИдентификаторКонтекста,
		|	КонтекстСообщенийИнтеграции.ДатаЗаписиНачалоЧаса,
		|	КонтекстСообщенийИнтеграции.Контекст,
		|	КонтекстСообщенийИнтеграции.ДлительностьМс,
		|	КонтекстСообщенийИнтеграции.ДатаСобытия,
		|	КонтекстСообщенийИнтеграции.ДатаСобытияМс КАК ДатаСобытияМс,
		|	КонтекстСообщенийИнтеграции.ДатаОтвета,
		|	КонтекстСообщенийИнтеграции.Статус
		|ИЗ
		|	РегистрСведений.рдв_КонтекстСообщенийИнтеграции КАК КонтекстСообщенийИнтеграции
		|ГДЕ
		|	КонтекстСообщенийИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения
		|	И КонтекстСообщенийИнтеграции.ИдентификаторКонтекста = &ИдентификаторКонтекста
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСобытияМс УБЫВ";
	
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Запрос.УстановитьПараметр("ИдентификаторКонтекста", ИдентификаторКонтекста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Колонки = РезультатЗапроса.Колонки;
	Результат = Новый Структура();
	Для Каждого Колонка Из Колонки Цикл
		Результат.Вставить(Колонка.Имя)
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

Функция СообщениеКонтекстУдалить(ИдентификаторСообщения) Экспорт
		
	Набор = РегистрыСведений.рдв_КонтекстСообщенийИнтеграции.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	Набор.Записать();
	
КонецФункции

Функция СообщениеОбъектыУдалить(ИдентификаторСообщения) Экспорт

	Набор = РегистрыСведений.рдв_ОбъектыСообщенийИнтеграции.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	Набор.Записать();
		
КонецФункции

Функция СообщениеУдалить(ИдентификаторСообщения) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
		Набор.ДополнительныеСвойства.Вставить("ПолноеУдаление", Истина);
		Набор.Записать();
		
		СообщениеКонтекстУдалить(ИдентификаторСообщения);
		СообщениеОбъектыУдалить(ИдентификаторСообщения);
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Если ТранзакцияАктивна() Тогда
			ВызватьИсключение;
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Функция СообщениеАктуальныйКонтекст(ИдентификаторСообщения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтекстСообщенийИнтеграции.ИдентификаторСообщения,
	|	КонтекстСообщенийИнтеграции.ДатаСобытияМс
	|ПОМЕСТИТЬ втМаксимумПоПериоду
	|ИЗ
	|	РегистрСведений.рдв_КонтекстСообщенийИнтеграции КАК КонтекстСообщенийИнтеграции
	|ГДЕ
	|	КонтекстСообщенийИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтекстСообщенийИнтеграции.ИдентификаторСообщения,
	|	КонтекстСообщенийИнтеграции.ИдентификаторКонтекста,
	|	КонтекстСообщенийИнтеграции.ДатаЗаписиНачалоЧаса,
	|	КонтекстСообщенийИнтеграции.Контекст,
	|	КонтекстСообщенийИнтеграции.ДлительностьМс,
	|	КонтекстСообщенийИнтеграции.ДатаСобытия,
	|	КонтекстСообщенийИнтеграции.ДатаСобытияМс,
	|	КонтекстСообщенийИнтеграции.ДатаОтвета,
	|	КонтекстСообщенийИнтеграции.Статус
	|ИЗ
	|	РегистрСведений.рдв_КонтекстСообщенийИнтеграции КАК КонтекстСообщенийИнтеграции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимумПоПериоду КАК втМаксимумПоПериоду
	|		ПО втМаксимумПоПериоду.ИдентификаторСообщения = КонтекстСообщенийИнтеграции.ИдентификаторСообщения
	|		И КонтекстСообщенийИнтеграции.ДатаСобытияМс = втМаксимумПоПериоду.ДатаСобытияМс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рдв_СообщенияИнтеграции.ИдентификаторСообщения,
	|	рдв_СообщенияИнтеграции.ИдентификаторСобытия,
	|	рдв_СообщенияИнтеграции.ДатаЗаписиНачалоЧаса,
	|	рдв_СообщенияИнтеграции.ВидСообщения,
	|	рдв_СообщенияИнтеграции.ДанныеСообщения,
	|	рдв_СообщенияИнтеграции.РазмерСообщения,
	|	рдв_СообщенияИнтеграции.Направление,
	|	рдв_СообщенияИнтеграции.ВнешняяСистема,
	|	рдв_СообщенияИнтеграции.АдресМетода,
	|	рдв_СообщенияИнтеграции.СтатусОбработки,
	|	рдв_СообщенияИнтеграции.ДатаРегистрацииМс
	|ИЗ
	|	РегистрСведений.рдв_СообщенияИнтеграции КАК рдв_СообщенияИнтеграции
	|ГДЕ
	|	рдв_СообщенияИнтеграции.ИдентификаторСообщения = &ИдентификаторСообщения";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Структура = Новый Структура;
	
	РезультатЗапроса = Пакет[Пакет.ВГраница()];
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Структура;
	КонецЕсли;
	Колонки = РезультатЗапроса.Колонки;
	Сообщение = Новый Структура();
	Для Каждого Колонка Из Колонки Цикл
		Сообщение.Вставить(Колонка.Имя)
	КонецЦикла;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Сообщение, Выборка);
	Структура.Вставить("Сообщение", Сообщение);
	
	РезультатЗапроса = Пакет[Пакет.ВГраница()-1];
	Колонки = РезультатЗапроса.Колонки;
	Контекст = Новый Структура();
	Для Каждого Колонка Из Колонки Цикл
		Контекст.Вставить(Колонка.Имя)
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Контекст, Выборка);
	Структура.Вставить("Контекст", Контекст);
	
	Возврат Структура;
	
КонецФункции

Процедура СообщениеОбновитьСтатус(ИдентификаторСообщения, Статус) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	Набор.Прочитать();
	
	Запись = Набор[0];
	Запись.СтатусОбработки = Статус;
	Набор.ДополнительныеСвойства.Вставить("ОбновлениеСтатуса", Истина);
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти
